Revit 2027 API
Form.CanManipulateProfile Method
Tell if a profile can be deleted/moved/rotated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanManipulateProfile(
	int profileIndex
)
Public Function CanManipulateProfile (
	profileIndex As Integer
) As Boolean
public:
bool CanManipulateProfile(
	int profileIndex
)
member CanManipulateProfile :
        profileIndex : int -> bool
Parameters
profileIndex Int32
Index to specify the profile.
Return Value
Boolean
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace